package com.piliofpala.craftstudio.pangolin.infra.gatherplatform.imps.wdt.modules;

import java.util.HashMap;
import java.util.Map;

public class RegionCodeMapper {
    private static final Map<String, String> REGION_CODE_MAP = new HashMap<>();
    static {
        //地级市
        REGION_CODE_MAP.put("469003", "4604");//儋州市
        REGION_CODE_MAP.put("5222", "5206");//铜仁市
        REGION_CODE_MAP.put("5224", "5205");//毕节市
        REGION_CODE_MAP.put("5421", "5403");//昌都市
        REGION_CODE_MAP.put("5422", "5405");//山南市
        REGION_CODE_MAP.put("5423", "5402");//日喀则市
        REGION_CODE_MAP.put("5424", "5406");//那曲市
        REGION_CODE_MAP.put("5426", "5404");//林芝市
        REGION_CODE_MAP.put("6321", "6302");//海东市
        REGION_CODE_MAP.put("6521", "6504");//吐鲁番市
        REGION_CODE_MAP.put("6522", "6505");//哈密市

        //区县
        // ================北京市===================
        REGION_CODE_MAP.put("110103", "110101");//崇文区并入东城区
        REGION_CODE_MAP.put("110104", "110102");//宣武区并入西城区
        REGION_CODE_MAP.put("110228", "110118");//密云区
        REGION_CODE_MAP.put("110229", "110119");//延庆区
        REGION_CODE_MAP.put("110230", "1101");//其他统一化为市辖区

        // ================天津市===================
        REGION_CODE_MAP.put("120221", "120117"); //宁河区,2015-09-24 批复撤销宁河县、设立宁河区
        REGION_CODE_MAP.put("120223", "120118"); //静海区2015-07-23 批复撤销静海县、设立静海区
        REGION_CODE_MAP.put("120225", "120119"); //蓟州区
        REGION_CODE_MAP.put("120107", "120116"); //塘沽区,和汉沽区,大港区合并为滨海新区
        REGION_CODE_MAP.put("120108", "120116"); //汉沽区,和塘沽区,大港区合并为滨海新区
        REGION_CODE_MAP.put("120109", "120116"); //大港区,和塘沽区,汉沽区合并为滨海新区 2009年11月
        REGION_CODE_MAP.put("120226", "1201"); //其他统一化为市辖区

        // ================河北省====================
        // ================石家庄市==================
        REGION_CODE_MAP.put("130103", "130102"); //桥东区并入长安区  2010年7月
        REGION_CODE_MAP.put("130124", "130111"); //栾城区
        REGION_CODE_MAP.put("130182", "130109"); //藁城区
        REGION_CODE_MAP.put("130185", "130110"); //鹿泉区
        REGION_CODE_MAP.put("130186", "130101"); //其他统一化为市辖区,
        // ================唐山市==================
        REGION_CODE_MAP.put("130223", "130284"); //滦县 撤县设市,滦州市 2018年9月
        REGION_CODE_MAP.put("130230", "130209"); //曹妃甸区
        REGION_CODE_MAP.put("130285", "130284"); //滦州市
        REGION_CODE_MAP.put("130284", "130201"); //其他统一化为市辖区
        // ================秦皇岛市================
        REGION_CODE_MAP.put("130323", "130306"); //抚宁区
        REGION_CODE_MAP.put("130399", "130371"); //抚宁区
        REGION_CODE_MAP.put("130398", "130301"); //其他统一化为市辖区
        // ================邯郸市==================
        REGION_CODE_MAP.put("130421", "130402"); //邯郸县 拆分邯山区(130402)和丛台区(130403)
        REGION_CODE_MAP.put("130428", "130407"); //肥乡区
        REGION_CODE_MAP.put("130429", "130408"); //永年区
        REGION_CODE_MAP.put("130482", "130401"); //其他统一化为市辖区
        // ================邢台市==================
        REGION_CODE_MAP.put("130521", "130503"); //邢台县并入信都区  2020.6
        REGION_CODE_MAP.put("130526", "130505"); //任泽区
        REGION_CODE_MAP.put("130527", "130506"); //南和区
        REGION_CODE_MAP.put("130583", "130501"); //其他统一化为市辖区
        // ================保定市==================
        REGION_CODE_MAP.put("130603", "130606"); //莲池区
        REGION_CODE_MAP.put("130604", "130606"); //莲池区,2015.5南市区和北市区合并
        REGION_CODE_MAP.put("130621", "130607"); //满城区
        REGION_CODE_MAP.put("130622", "130608"); //清苑区
        REGION_CODE_MAP.put("130625", "130609"); //徐水区
        REGION_CODE_MAP.put("130698", "130602"); //虚拟编码归属竞秀区
        REGION_CODE_MAP.put("130699", "130601"); //其他统一化为市辖区
        // ================张家口市==================
        REGION_CODE_MAP.put("130721", "130705"); //2016并入宣化
        REGION_CODE_MAP.put("130729", "130708"); //万全区
        REGION_CODE_MAP.put("130733", "130709"); //崇礼区
        REGION_CODE_MAP.put("130734", "130701"); //其他统一化为市辖区
        // ================承德市==================
        REGION_CODE_MAP.put("130823", "130881"); //平泉市
        REGION_CODE_MAP.put("130829", "130801"); //其他统一化为市辖区
        // ================沧州市==================
        REGION_CODE_MAP.put("130985", "130901"); //其他统一化为市辖区
        // ================廊坊市==================
        REGION_CODE_MAP.put("131051", "131003"); //131051 廊坊经济技术开发区（廊坊经开区，市区东边,广阳区131003托管）
        REGION_CODE_MAP.put("131052", "131082"); //燕郊经济技术开发区（燕郊高新区,三河市131082境内）
        REGION_CODE_MAP.put("131083", "131001"); //其他统一化为市辖区
        // ================衡水市==================
        REGION_CODE_MAP.put("131181", "131103"); //冀州区
        REGION_CODE_MAP.put("131183", "131101"); //其他统一化为市辖区
        //***********以下未有相关的编码 START***************
        REGION_CODE_MAP.put("133101", "130638");
        REGION_CODE_MAP.put("133102", "130629");
        REGION_CODE_MAP.put("133103", "130632");

        // ================山西省==================
        // ================太原市=================
        REGION_CODE_MAP.put("140182", "140101"); //其他统一化为市辖区
        // ================大同市=================
        REGION_CODE_MAP.put("140202", "140213"); //2018年 城区(140202)撤销,设立平城区(140213)
        REGION_CODE_MAP.put("140203", "140214"); //2018年 矿区(140203)撤销,设立云冈区(140214)
        REGION_CODE_MAP.put("140211", "140214");  //南郊区并入云冈区
        REGION_CODE_MAP.put("140227", "140215"); //云州区
        REGION_CODE_MAP.put("140228", "140201"); //其他统一化为市辖区
        // ================阳泉市=================
        REGION_CODE_MAP.put("140323", "140301"); //其他统一化为市辖区
        // ================长治市=================
        REGION_CODE_MAP.put("140402", "140403"); //潞州区,编码变更
        REGION_CODE_MAP.put("140421", "140404"); //撤销长治县(140421)，设立上党区(140404)
        REGION_CODE_MAP.put("140424", "140405"); //屯留区
        REGION_CODE_MAP.put("140481", "140406"); //潞城区
        REGION_CODE_MAP.put("140482", "140401"); //城区,编码不存在,统一化为市辖区
        REGION_CODE_MAP.put("140483", "140401"); //郊区,编码不存在,统一化为市辖区
        REGION_CODE_MAP.put("140484", "140401"); //高新区,编码不存在,统一化为市辖区
        REGION_CODE_MAP.put("140485", "140401"); //其他统一化为市辖区
        // ================晋城市=================
        REGION_CODE_MAP.put("140582", "140501"); //其他统一化为市辖区
        // ================朔州市=================
        REGION_CODE_MAP.put("140624", "140681"); // 怀仁市,编码变更
        REGION_CODE_MAP.put("140625", "140601"); //其他统一化为市辖区
        // ================晋中市=================
        REGION_CODE_MAP.put("140726", "140703"); //太谷区,编码变更
        REGION_CODE_MAP.put("140782", "140701"); //其他统一化为市辖区
        // ================运城市=================
        REGION_CODE_MAP.put("140883", "140801"); //其他统一化为市辖区
        // ================忻州市=================
        REGION_CODE_MAP.put("140982", "140901"); //其他统一化为市辖区
        // ================临汾市=================
        REGION_CODE_MAP.put("141083", "141001"); //其他统一化为市辖区
        // ================吕梁市=================
        REGION_CODE_MAP.put("141183", "141101"); //其他统一化为市辖区

        //================内蒙古自治区===============
        //================呼和浩特市=================
        REGION_CODE_MAP.put("150126", "150101"); //其他统一化为市辖区
        //================包头市====================
        REGION_CODE_MAP.put("150224", "150201"); //其他统一化为市辖区
        //================乌海市====================
        REGION_CODE_MAP.put("150305", "150301"); //其他统一化为市辖区
        //================赤峰市====================
        REGION_CODE_MAP.put("150431", "150401"); //其他统一化为市辖区
        //================通辽市====================
        REGION_CODE_MAP.put("150531", "150501"); //其他统一化为市辖区
        //================鄂尔多斯市====================
        REGION_CODE_MAP.put("150628", "150601"); //其他统一化为市辖区
        //================呼伦贝尔市====================
        REGION_CODE_MAP.put("150786", "150701"); //其他统一化为市辖区
        //================巴彦淖尔市====================
        REGION_CODE_MAP.put("150827", "150801"); //其他统一化为市辖区
        //================乌兰察布市====================
        REGION_CODE_MAP.put("150982", "150901"); //其他统一化为市辖区
        //================兴安盟====================
        REGION_CODE_MAP.put("152225", "152201"); //其他统一化为盟府
        //================锡林郭勒盟====================
        REGION_CODE_MAP.put("152532", "152501"); //其他统一化为盟府
        //================阿拉善盟====================
        REGION_CODE_MAP.put("152924", "152921"); //其他统一化为盟府

        //================辽宁省=========================
        //================沈阳市=========================
        //'新城子区'=>210113,名称并更沈北新区
        REGION_CODE_MAP.put("210122", "210115");
        REGION_CODE_MAP.put("210184", "210113");
        REGION_CODE_MAP.put("210182", "210101");//浑南新区 编码不存在,统一化为市辖区
        REGION_CODE_MAP.put("210183", "210101");//张士开发区 编码不存在,统一化为市辖区
        REGION_CODE_MAP.put("210185", "210101");//其他统一化为市辖区
        //================大连市=========================
        REGION_CODE_MAP.put("210251", "210213");//开发区,隶属金州区(210213)
        REGION_CODE_MAP.put("210282", "210214");//普兰店区
        REGION_CODE_MAP.put("210297", "210213");//岭前区,隶属金州区
        REGION_CODE_MAP.put("210298", "210201");//其他统一化为市辖区
        //================鞍山市=========================
        REGION_CODE_MAP.put("210351", "210301");//高新区,未启用映射到市辖区
        REGION_CODE_MAP.put("210382", "210301");//其他统一化为市辖区
        //================抚顺市=========================
        REGION_CODE_MAP.put("210424", "210401");//其他统一化为市辖区
        //================本溪市=========================
        REGION_CODE_MAP.put("210523", "210501");//其他统一化为市辖区
        //================丹东市=========================
        REGION_CODE_MAP.put("210683", "210601");//其他统一化为市辖区
        //================锦州市=========================
        REGION_CODE_MAP.put("210783", "210701");//其他统一化为市辖区
        //================营口市=========================
        REGION_CODE_MAP.put("210883", "210801");//其他统一化为市辖区
        //================阜新市=========================
        REGION_CODE_MAP.put("210923", "210901");//其他统一化为市辖区
        //================辽阳市=========================
        REGION_CODE_MAP.put("211082", "211001");//其他统一化为市辖区
        //================盘锦市=========================
        REGION_CODE_MAP.put("211121", "211104");
        REGION_CODE_MAP.put("211123", "211101");//其他统一化为市辖区
        //================铁岭市=========================
        REGION_CODE_MAP.put("211283", "211201");//其他统一化为市辖区
        //================朝阳市=========================
        REGION_CODE_MAP.put("211383", "211301");//其他统一化为市辖区
        //================葫芦岛市========================
        REGION_CODE_MAP.put("211482", "211401");//其他统一化为市辖区

        //================吉林省========================
        //================长春市=========================
        REGION_CODE_MAP.put("220181", "220113");//九台区,编码变更
        REGION_CODE_MAP.put("220185", "220101");//汽车产业开发区,映射到市辖区
        REGION_CODE_MAP.put("220186", "220101");//经济技术开发区, 映射到市辖区
        REGION_CODE_MAP.put("220187", "220101");//净月旅游开发区, 映射到市辖区
        REGION_CODE_MAP.put("220188", "220101");//其他统一化为市辖区
        //================吉林市=========================
        REGION_CODE_MAP.put("220285", "220201");//其他统一化为市辖区
        //================四平市=========================
        REGION_CODE_MAP.put("220383", "220301");//其他统一化为市辖区
        REGION_CODE_MAP.put("220381", "220184");//公主岭市,2020.6 划归到长春市
        //================辽源市=========================
        REGION_CODE_MAP.put("220423", "220401");//其他统一化为市辖区
        //================通化市=========================
        REGION_CODE_MAP.put("220583", "220501");//其他统一化为市辖区
        //================白山市=========================
        REGION_CODE_MAP.put("220625", "220605");//江源区,编码变更
        REGION_CODE_MAP.put("220682", "220601");//其他统一化为市辖区
        //================松原市=========================
        REGION_CODE_MAP.put("220724", "220781");//扶余市,编码变更
        REGION_CODE_MAP.put("220725", "220701");//其他统一化为市辖区
        //================白城市=========================
        REGION_CODE_MAP.put("220883", "220801");//其他统一化为市辖区
        //================延边朝鲜族自治州=================
        REGION_CODE_MAP.put("222427", "222401");//其他统一化为州府

        //================黑龙江省========================
        //================哈尔滨=========================
        REGION_CODE_MAP.put("230106", "230110");//和原动力区合并为新香坊区
        REGION_CODE_MAP.put("230107", "230110");//和原香坊区合并为新香坊区
        REGION_CODE_MAP.put("230181", "230112");//阿城区,2006 年撤市设阿城区,现行编码改为 230112（阿城区）
        REGION_CODE_MAP.put("230182", "230113");//双城区,编码变更
        REGION_CODE_MAP.put("230185", "230112");//其他统一化为市辖区
        REGION_CODE_MAP.put("230186", "230101");//其他统一化为市辖区
        //================齐齐哈尔市=========================
        REGION_CODE_MAP.put("230282", "230201");//其他统一化为市辖区
        //================鸡西市=========================
        REGION_CODE_MAP.put("230383", "230301");//其他统一化为市辖区
        //================鹤岗市=========================
        REGION_CODE_MAP.put("230423", "230401");//其他统一化为市辖区
        //================双鸭山市=========================
        REGION_CODE_MAP.put("230525", "230501");//其他统一化为市辖区
        //================大庆市=========================
        REGION_CODE_MAP.put("230625", "230601");//其他统一化为市辖区
        //================伊春市=========================
        REGION_CODE_MAP.put("230702", "230717");//伊春区已撤销 2019年,伊春区 + 美溪区 + 乌马河区部分合并为伊美区,新行政区划代码：230717
        REGION_CODE_MAP.put("230703", "230726");//南岔县,编码变更
        REGION_CODE_MAP.put("230704", "230719");//原友好区已撤销 2019年原上甘岭区 + 原友好区(230704)合并,设立新友好区，新代码：230719
        REGION_CODE_MAP.put("230705", "230751");//西林区已撤销,2019年 西林区 + 金山屯区合并 → 金林区，新代码：230751
        REGION_CODE_MAP.put("230706", "230718");//翠峦区已撤销, 2019年 翠峦区 + 乌马河区部分合并 → 乌翠区，新代码：230718
        REGION_CODE_MAP.put("230707", "230724");//新青区已撤销, 2019年新青区 + 红星区 + 五营区合并 → 丰林县，新代码：230724
        REGION_CODE_MAP.put("230708", "230717");//美溪区,2019年,伊春区 + 美溪区 + 乌马河区部分合并为伊美区,新行政区划代码：230717
        REGION_CODE_MAP.put("230709", "230751");//金山屯区已撤销,2019年 西林区 + 金山屯区合并 → 金林区，新代码：230751
        REGION_CODE_MAP.put("230710", "230724");//五营区已撤销,2019年新青区 + 红星区 + 五营区合并 → 丰林县，新代码：230724
        REGION_CODE_MAP.put("230711", "230718");//乌马河区已撤销,2019年 翠峦区 + 乌马河区部分合并 → 乌翠区，新代码：230718
        REGION_CODE_MAP.put("230712", "230723");//汤旺河区已撤销,2019 汤旺河区 + 乌伊岭区(230714)合并 → 汤旺县，新代码：230723
        REGION_CODE_MAP.put("230713", "230725");//带岭区已撤销,2019 带岭区 + 划入铁力市朗乡镇 → 大箐山县，新代码：230725
        REGION_CODE_MAP.put("230714", "230723");//乌伊岭区已撤销,2019 汤旺河区 + 乌伊岭区(230714)合并 → 汤旺县，新代码：230723
        REGION_CODE_MAP.put("230715", "230724");//红星区,已撤销,2019年新青区 + 红星区 + 五营区合并 → 丰林县，新代码：230724
        REGION_CODE_MAP.put("230716", "230719");//上甘岭区已撤销 2019年原上甘岭区 + 原友好区(230704)合并,设立新友好区，新代码：230719
        REGION_CODE_MAP.put("230782", "230701");//其他统一化为市辖区
        //================佳木斯市==================
        REGION_CODE_MAP.put("230802", "230811");//2006 年撤销永红区,主体划归[佳木斯市郊区,新代码 230805],另有一小部分街道提前划给向阳区(230803)
        REGION_CODE_MAP.put("230833", "230883");//撤销抚远县城,设置抚远市,
        REGION_CODE_MAP.put("230883", "230801");//其他统一化为市辖区
        //================七台河市==================
        REGION_CODE_MAP.put("230922", "230901");//其他统一化为市辖区
        //================牡丹江市==================
        REGION_CODE_MAP.put("231024", "231086");//2015 年撤县设市，变更为 231086 东宁市
        REGION_CODE_MAP.put("231086", "231001");//其他统一化为市辖区
        //================黑河市==================
        REGION_CODE_MAP.put("231121", "231183");//2019 年撤嫩江县设立县级嫩江市，新行政区划代码：231183
        REGION_CODE_MAP.put("231183", "231101");//其他统一化为市辖区
        //================绥化市==================
        REGION_CODE_MAP.put("231284", "231201");//其他统一化为市辖区
        //================大兴安岭地区==================
        REGION_CODE_MAP.put("232702", "232762");//松岭区,代码变更
        REGION_CODE_MAP.put("232703", "232763");//新林区,代码变更
        REGION_CODE_MAP.put("232704", "232764");//呼中区,代码变更
        REGION_CODE_MAP.put("232723", "232701");//2018 年撤漠河县设漠河市，启用232701
        REGION_CODE_MAP.put("232724", "232761");//加格达奇区,
        REGION_CODE_MAP.put("232725", "232701");//其他统一化为大兴安岭地区

        //================上海市==================
        //================市辖区==================
        REGION_CODE_MAP.put("310103", "310101");//2011年卢湾区并入黄浦区
        REGION_CODE_MAP.put("310108", "310106");//2015 闸北区并入静安区
        REGION_CODE_MAP.put("310119", "310115");//2009年撤销南汇区并入浦东新区
        REGION_CODE_MAP.put("310152", "3101");//川沙区,编码不存在,统一化为市辖区
        REGION_CODE_MAP.put("310230", "310151");// 2016 年崇明撤县设区编码变更
        REGION_CODE_MAP.put("310231", "3101");//其他统一化为市辖区

        //================江苏省==================
        //================南京市==================
        REGION_CODE_MAP.put("320103", "320104");//白下区,2013年并入秦淮区
        REGION_CODE_MAP.put("320107", "320106");//下关区2013并入鼓楼区
        REGION_CODE_MAP.put("320124", "320117");//2013 年撤溧水县溧水区320117
        REGION_CODE_MAP.put("320125", "320118");//2013 年撤高淳县设立高淳区320118
        REGION_CODE_MAP.put("320126", "320101");//其他统一化为市辖区
        //================无锡市==================
        REGION_CODE_MAP.put("320202", "320213");//崇安区已撤消,2015崇安区(320202)+ 南长区(320203)+ 北塘区(320204))三区合并,设立梁溪区，现行代码：320213
        REGION_CODE_MAP.put("320203", "320213");//南长区已撤消,2015崇安区(320202)+ 南长区(320203)+ 北塘区(320204))三区合并,设立梁溪区，现行代码：320213
        REGION_CODE_MAP.put("320204", "320213");//北塘区已撤消,2015崇安区(320202)+ 南长区(320203)+ 北塘区(320204))三区合并,设立梁溪区，现行代码：320213
        REGION_CODE_MAP.put("320296", "320201");//新区,编码不存在,统一化为市辖区
        REGION_CODE_MAP.put("320297", "320201");//其他统一化为市辖区
        //================徐州市==================
        REGION_CODE_MAP.put("320304", "320312");//九里区,2010主体并入铜山区
        REGION_CODE_MAP.put("320323", "320312");//2010 年撤铜山县设立铜山区编码变更
        REGION_CODE_MAP.put("320383", "320301");//其他统一化为市辖区
        //================常州市==================
        REGION_CODE_MAP.put("320405", "320412");//戚墅堰区2015撤销戚墅堰区并入武进区
        REGION_CODE_MAP.put("320482", "320413");//2015撤市设金坛区,编码变更
        REGION_CODE_MAP.put("320483", "320401");//其他统一化为市辖区
        //================苏州市==================
        REGION_CODE_MAP.put("320502", "320508");//沧浪区已撤销,2012沧浪区(320502)+ 平江区(320503)+ 金阊区(320504)三区合并，设立姑苏区(320508)
        REGION_CODE_MAP.put("320503", "320508");//平江区已撤销,2012沧浪区(320502)+ 平江区(320503)+ 金阊区(320504)三区合并，设立姑苏区(320508)
        REGION_CODE_MAP.put("320504", "320508");//金阊区已撤销,2012沧浪区(320502)+ 平江区(320503)+ 金阊区(320504)三区合并，设立姑苏区(320508)
        REGION_CODE_MAP.put("320584", "320509");//2012 年撤县级吴江市,编码变更
        REGION_CODE_MAP.put("320586", "320571");//苏州工业园区,编码变更
        REGION_CODE_MAP.put("320594", "320505");//新区,苏州新区即苏州高新区(虎丘区)
        REGION_CODE_MAP.put("320595", "320571");//苏州工业园区,编码变更
        REGION_CODE_MAP.put("320596", "320501");//其他统一化为市辖区
        //================南通市==================
        REGION_CODE_MAP.put("320602", "320613");//崇川区,2020 年区划调整原崇川区(320602)+ 港闸区(320611))合并,设立新崇川区(320613)
        REGION_CODE_MAP.put("320611", "320613");//港闸区,2020 年区划调整原崇川区(320602)+ 港闸区(320611))合并,设立新崇川区(320613)
        REGION_CODE_MAP.put("320621", "320685");//海安县(320621)，2018 年撤县设立县级海安市(320685)
        REGION_CODE_MAP.put("320683", "320612");//通州市,2009年撤销通州市,设立南通市通州区(320612)
        REGION_CODE_MAP.put("320684", "320601");//海门市,编码不存在,统一化为市辖区
        REGION_CODE_MAP.put("320693", "320601");//开发区,编码不存在,统一化为市辖区
        REGION_CODE_MAP.put("320694", "320601");//其他统一化为市辖区
        //================连云港市==================
        REGION_CODE_MAP.put("320705", "320706");//新浦区2014 撤销新浦区(320705)+ 原海州区(320706)
        REGION_CODE_MAP.put("320721", "320707");//赣榆区2014 年撤县设赣榆区(320707)
        REGION_CODE_MAP.put("320725", "320701");//其他统一化为市辖区
        //================淮安市==================
        REGION_CODE_MAP.put("320802", "320812");//原清河区(320802)、原清浦区(320811)，2016 清江浦区(320812)
        REGION_CODE_MAP.put("320811", "320812");//清浦区,原清河区(320802)、原清浦区(320811)，2016 清江浦区(320812)
        REGION_CODE_MAP.put("320829", "320813");//洪泽区2016年撤洪泽县设立洪泽区(320813)
        REGION_CODE_MAP.put("320832", "320801");//其他统一化为市辖区
        //================盐城市==================
        REGION_CODE_MAP.put("320982", "320904");//大丰区2015撤市设大丰区(320904)
        REGION_CODE_MAP.put("320983", "320901");//其他统一化为市辖区
        //================扬州市==================
        REGION_CODE_MAP.put("321011", "321003");//维扬区,2011 撤销维扬区,辖区整体并入邗江区(321003)
        REGION_CODE_MAP.put("321088", "321012");//江都区,2011 撤市设江都区(321012)
        REGION_CODE_MAP.put("321092", "321001");//经济开发区,编码不存在,统一化为市辖区
        REGION_CODE_MAP.put("321093", "321001");//其他统一化为市辖区
        //================镇江市==================
        REGION_CODE_MAP.put("321184", "321101");//其他统一化为市辖区
        REGION_CODE_MAP.put("321185", "321171");//镇江新区
        //================泰州市==================
        REGION_CODE_MAP.put("321284", "321204");//姜堰区,2012撤市设姜堰区(321204)
        REGION_CODE_MAP.put("321285", "321201");//其他统一化为市辖区
        //================宿迁市==================
        REGION_CODE_MAP.put("321325", "321301");//其他统一化为市辖区

        // ================杭州市===================
        REGION_CODE_MAP.put("330103", "330105");//下城区并入拱墅区
        REGION_CODE_MAP.put("330104", "330102");//江干区并入上城区
        REGION_CODE_MAP.put("330183", "330111");//富阳区
        REGION_CODE_MAP.put("330185", "330112");//临安区
        REGION_CODE_MAP.put("330186", "330101");//其他统一化为市辖区
        // ================宁波市===================
        //================宁波市==================
        REGION_CODE_MAP.put("330204", "330212");//江东区,2016年撤销并入鄞州区
        REGION_CODE_MAP.put("330283", "330213");//奉化区,
        REGION_CODE_MAP.put("330284", "330201");//其他统一化为市辖区
        //================温州市==================
        REGION_CODE_MAP.put("330322", "330305");//洞头区,
        REGION_CODE_MAP.put("330383", "330301");//其他统一化为市辖区
        REGION_CODE_MAP.put("330384", "330383");//龙港市,
        //================嘉兴市==================
        REGION_CODE_MAP.put("330484", "330401");//其他统一化为市辖区
        //================湖州市==================
        REGION_CODE_MAP.put("330524", "330501");//其他统一化为市辖区
        //================绍兴市==================
        REGION_CODE_MAP.put("330621", "330603");//柯桥区,
        REGION_CODE_MAP.put("330682", "330604");//上虞区,
        REGION_CODE_MAP.put("330684", "330601");//其他统一化为市辖区
        //================金华市==================
        REGION_CODE_MAP.put("330785", "330701");//其他统一化为市辖区
        //================衢州市==================
        REGION_CODE_MAP.put("330882", "330801");//其他统一化为市辖区
        //================舟山市==================
        REGION_CODE_MAP.put("330923", "330901");//其他统一化为市辖区
        //================台州市==================
        REGION_CODE_MAP.put("331021", "331083");//玉环市,
        REGION_CODE_MAP.put("331083", "331001");//其他统一化为市辖区
        //================丽水市==================
        REGION_CODE_MAP.put("331182", "331101");//其他统一化为市辖区

        //================安徽省==================
        //================合肥市==================
        REGION_CODE_MAP.put("340151", "340171");//高新区,合肥高新区为独立统计用区划单位,编码为340171
        REGION_CODE_MAP.put("340191", "340103");//中区(原中市区);2002年更名为庐阳区
        REGION_CODE_MAP.put("340192", "340101");//其他统一化为市辖区
        REGION_CODE_MAP.put("340193", "340172");//经济技术开发区,合肥经开区为独立统计用区划单位,编码为340172
        //================芜湖市==================
        REGION_CODE_MAP.put("340203", "340209");//弋江区,
        REGION_CODE_MAP.put("340208", "340209");//三山区,2020年撤销与原弋江区合并设新弋江区
        REGION_CODE_MAP.put("340221", "340210");//芜湖县,2020年撤县设湾沚区
        REGION_CODE_MAP.put("340222", "340212");//繁昌区,2020年撤繁昌县设繁昌区,
        REGION_CODE_MAP.put("340224", "340201");//其他统一化为市辖区
        //================蚌埠市==================
        REGION_CODE_MAP.put("340324", "340301");//其他统一化为市辖区
        //================淮南市==================
        REGION_CODE_MAP.put("340422", "340401");//其他统一化为市辖区
        REGION_CODE_MAP.put("340499", "340422");//寿县,
        //================马鞍山市==================
        REGION_CODE_MAP.put("340502", "340503");//金家庄区,2012年撤销并入花山区
        REGION_CODE_MAP.put("340522", "340501");//其他统一化为市辖区
        //================淮北市==================
        REGION_CODE_MAP.put("340622", "340601");//其他统一化为市辖区
        //================铜陵市==================
        REGION_CODE_MAP.put("340702", "340705");//铜官山区,2015年撤销与狮子山区合并设铜官区
        REGION_CODE_MAP.put("340703", "340705");//狮子山区,2015年撤销与铜官山区合并设铜官区
        REGION_CODE_MAP.put("340721", "340706");//义安区,
        REGION_CODE_MAP.put("340722", "340701");//其他统一化为市辖区
        REGION_CODE_MAP.put("340799", "340722");//枞阳县,
        //================安庆市==================
        REGION_CODE_MAP.put("340823", "340722");//枞阳县,2016年划归铜陵市
        REGION_CODE_MAP.put("340824", "340882");//潜山市,2018-07 批复撤销潜山县设立县级潜山市
        REGION_CODE_MAP.put("340882", "340801");//其他统一化为市辖区
        //================黄山市==================
        REGION_CODE_MAP.put("341025", "341001");//其他统一化为市辖区
        //================滁州市==================
        REGION_CODE_MAP.put("341183", "341101");//其他统一化为市辖区
        //================阜阳市==================
        REGION_CODE_MAP.put("341283", "341201");//其他统一化为市辖区
        //================宿州市==================
        REGION_CODE_MAP.put("341325", "341301");//其他统一化为市辖区
        //================巢湖市(原地级,2011年撤销)==================
        REGION_CODE_MAP.put("341400", "340181");//巢湖市,
        REGION_CODE_MAP.put("341402", "340181");//居巢区,2011年撤地级巢湖市,以原居巢区设县级巢湖市(合肥市代管)
        REGION_CODE_MAP.put("341421", "340124");//庐江县,2011年撤地级巢湖市,划归合肥市
        REGION_CODE_MAP.put("341422", "340281");//无为市,2011年划归芜湖市,2019年撤县设市
        REGION_CODE_MAP.put("341423", "340522");//含山县,2011年撤地级巢湖市,划归马鞍山市
        REGION_CODE_MAP.put("341424", "340523");//和县,2011年撤地级巢湖市,划归马鞍山市
        //================六安市==================
        REGION_CODE_MAP.put("341521", "340422");//寿县,2015-12-03 批复，**2016 年 1 月正式由六安划归淮南**
        REGION_CODE_MAP.put("341526", "341501");//其他统一化为市辖区
        //================亳州市==================
        REGION_CODE_MAP.put("341624", "341601");//其他统一化为市辖区
        //================池州市==================
        REGION_CODE_MAP.put("341724", "341701");//其他统一化为市辖区
        //================宣城市==================
        REGION_CODE_MAP.put("341822", "341882");//广德县,2019-07-12 批复撤销广德县、设立县级广德市
        REGION_CODE_MAP.put("341882", "341801");//其他统一化为市辖区
        REGION_CODE_MAP.put("341884", "341882");//广德市

        //================福建省==================
        //================福州市==================
        REGION_CODE_MAP.put("350182", "350112");//长乐区,2017-09 国务院批复撤销长乐市，设立长乐区
        REGION_CODE_MAP.put("350183", "350101");//其他统一化为市辖区
        //================厦门市==================
        REGION_CODE_MAP.put("350214", "350201");//其他统一化为市辖区
        //================莆田市==================
        REGION_CODE_MAP.put("350323", "350301");//其他统一化为市辖区
        //================三明市==================
        REGION_CODE_MAP.put("350402", "350404");//梅列区,2021年撤销与原三元区合并设新三元区
        REGION_CODE_MAP.put("350403", "350404");//三元区,2021-02 国务院批复撤销梅列区、老三元区合并设立新三元区
        REGION_CODE_MAP.put("350427", "350405");//沙县区,2021年撤沙县设沙县区,
        REGION_CODE_MAP.put("350482", "350401");//其他统一化为市辖区
        //================泉州市==================
        REGION_CODE_MAP.put("350584", "350501");//其他统一化为市辖区
        //================漳州市==================
        REGION_CODE_MAP.put("350625", "350605");//长泰区,2021年撤长泰县设长泰区,
        REGION_CODE_MAP.put("350681", "350604");//龙海区,2021年撤龙海市设龙海区,
        REGION_CODE_MAP.put("350682", "350601");//其他统一化为市辖区
        //================南平市==================
        REGION_CODE_MAP.put("350784", "350703");//建阳区,2014-05-27 批复撤销建阳市，设立建阳区
        REGION_CODE_MAP.put("350785", "350701");//其他统一化为市辖区
        //================龙岩市==================
        REGION_CODE_MAP.put("350822", "350803");//永定区,2014-12-13 批复撤销永定县设立永定区
        REGION_CODE_MAP.put("350882", "350801");//其他统一化为市辖区
        //================宁德市==================
        REGION_CODE_MAP.put("350983", "350901");//其他统一化为市辖区

        //================江西省==================
        //================南昌市==================
        REGION_CODE_MAP.put("360105", "360112");//湾里区,2019年撤销并入新建区
        REGION_CODE_MAP.put("360122", "360112");//新建区,红谷滩是**新设立的市辖区**，不是由某个老区县更名而来；辖区原分属东湖区`360102`、新建区`360112`
        REGION_CODE_MAP.put("360125", "360113");//红谷滩区,红谷滩是**新设立的市辖区**，不是由某个老区县更名而来；辖区原分属东湖区`360102`、新建区`360112`
        REGION_CODE_MAP.put("360126", "360112");//经济技术开发区,南昌经开区代管区域属新建区
        REGION_CODE_MAP.put("360127", "360112");//昌北区,昌北经济开发区行政上属新建区,由南昌经开区代管
        REGION_CODE_MAP.put("360128", "360101");//其他统一化为市辖区
        REGION_CODE_MAP.put("360129", "360111");//高新区,南昌高新区主要关联青山湖区,
        REGION_CODE_MAP.put("360131", "360113");//红谷滩新区,现为红谷滩区(360113)
        //================景德镇市==================
        REGION_CODE_MAP.put("360282", "360201");//其他统一化为市辖区
        //================萍乡市==================
        REGION_CODE_MAP.put("360324", "360301");//其他统一化为市辖区
        //================九江市==================
        REGION_CODE_MAP.put("360421", "360404");//柴桑区,2017-08-21 批复撤销九江县、设立柴桑区
        REGION_CODE_MAP.put("360427", "360483");//庐山市,2016-05-12 批复撤销星子县，设立县级庐山市
        REGION_CODE_MAP.put("360482", "360401");//其他统一化为市辖区
        REGION_CODE_MAP.put("360483", "360482");//共青城市,2016年星子县改设庐山市启用360483,共青城市改用360482(360483在world.json中为庐山市)
        //================新余市==================
        REGION_CODE_MAP.put("360522", "360501");//其他统一化为市辖区
        //================鹰潭市==================
        REGION_CODE_MAP.put("360622", "360603");//余江区,2018-02-09 国务院批复撤销余江县、设立余江区
        REGION_CODE_MAP.put("360682", "360601");//其他统一化为市辖区
        //================赣州市==================
        REGION_CODE_MAP.put("360721", "360704");//赣县区,国函〔2016〕156 号，2016-09-14 国务院批复撤销赣县、设立赣县区
        REGION_CODE_MAP.put("360727", "360783");//龙南县,现为龙南市(360783)
        REGION_CODE_MAP.put("360751", "360702");//黄金区,黄金岭区域属章贡区
        REGION_CODE_MAP.put("360782", "360703");//南康区,2013 年国函批复撤销县级南康市设立南康区
        REGION_CODE_MAP.put("360783", "360701");//其他统一化为市辖区
        REGION_CODE_MAP.put("360784", "360783");//龙南市,2020 年 6 月批复撤龙南县设县级龙南市
        //================吉安市==================
        REGION_CODE_MAP.put("360882", "360801");//其他统一化为市辖区
        //================宜春市==================
        REGION_CODE_MAP.put("360984", "360901");//其他统一化为市辖区
        //================抚州市==================
        REGION_CODE_MAP.put("361029", "361003");//东乡区,国函〔2016〕191 号，2016-11-24 国务院批复撤销东乡县设立东乡区
        REGION_CODE_MAP.put("361031", "361001");//其他统一化为市辖区
        //================上饶市==================
        REGION_CODE_MAP.put("361121", "361104");//广信区,国函〔2019〕59 号，2019-06-27 批复撤销上饶县、设立广信区
        REGION_CODE_MAP.put("361122", "361103");//广丰区,国函〔2015〕37 号，2015-02-16 批复撤销广丰县、设立广丰区
        REGION_CODE_MAP.put("361182", "361101");//其他统一化为市辖区

        //================山东省==================
        //================济南市==================
        REGION_CODE_MAP.put("370125", "370115");//济阳区,国函〔2018〕86 号，2018-06-19 批复撤销济阳县、设立济阳区
        REGION_CODE_MAP.put("370181", "370114");//章丘区,国函〔2016〕155 号，2016-09-14 批复撤销县级章丘市，设立章丘区
        REGION_CODE_MAP.put("370182", "370101");//其他统一化为市辖区
        //================青岛市==================
        REGION_CODE_MAP.put("370205", "370203");//四方区,2012年撤销与原市北区合并设新市北区
        REGION_CODE_MAP.put("370251", "370211");//开发区,青岛经济技术开发区位于黄岛区,
        REGION_CODE_MAP.put("370284", "370211");//胶南市,2012年撤销与原黄岛区合并设新黄岛区
        REGION_CODE_MAP.put("370286", "370201");//其他统一化为市辖区
        //================淄博市==================
        REGION_CODE_MAP.put("370324", "370301");//其他统一化为市辖区
        //================枣庄市==================
        REGION_CODE_MAP.put("370482", "370401");//其他统一化为市辖区
        //================东营市==================
        REGION_CODE_MAP.put("370521", "370505");//垦利区,
        REGION_CODE_MAP.put("370589", "370502");//西城区,东营市西城属东营区
        REGION_CODE_MAP.put("370590", "370502");//东城区,东营市无东城区建制,东城街道属东营区
        REGION_CODE_MAP.put("370591", "370501");//其他统一化为市辖区
        //================烟台市==================
        REGION_CODE_MAP.put("370634", "370614");//长岛县,2020年撤销与蓬莱市合并设蓬莱区
        REGION_CODE_MAP.put("370684", "370614");//蓬莱区,国函〔2020〕81 号，2020-06-05 批复，撤销蓬莱市、长岛县，合并设立蓬莱区
        REGION_CODE_MAP.put("370688", "370601");//其他统一化为市辖区
        //================潍坊市==================
        REGION_CODE_MAP.put("370751", "370702");//开发区,即潍坊经济开发区,划归潍城区
        REGION_CODE_MAP.put("370787", "370701");//其他统一化为市辖区
        //================济宁市==================
        REGION_CODE_MAP.put("370802", "370811");//市中区,2013年撤销并入任城区
        REGION_CODE_MAP.put("370882", "370812");//兖州区,国函〔2013〕115 号，2013-10-18 批复撤销兖州市，设立兖州区
        REGION_CODE_MAP.put("370884", "370801");//其他统一化为市辖区
        //================泰安市==================
        REGION_CODE_MAP.put("370903", "370911");//岱岳区,民发〔2000〕95 号，2000-04-19 批复，泰安市郊区更名为岱岳区
        REGION_CODE_MAP.put("370984", "370901");//其他统一化为市辖区
        //================威海市==================
        REGION_CODE_MAP.put("371081", "371003");//文登区,国函〔2014〕13 号，2014-01-25 批复撤销县级文登市，设立文登区
        REGION_CODE_MAP.put("371084", "371001");//其他统一化为市辖区
        //================日照市==================
        REGION_CODE_MAP.put("371123", "371101");//其他统一化为市辖区
        //================莱芜市==================
        REGION_CODE_MAP.put("371202", "370116");//莱城区,2019年并入济南市,以原区域设莱芜区
        REGION_CODE_MAP.put("371203", "370117");//钢城区,2019年莱芜市并入济南市,划归济南市
        REGION_CODE_MAP.put("371204", "370101");//其他统一化为市辖区
        //================临沂市==================
        REGION_CODE_MAP.put("371330", "371301");//其他统一化为市辖区
        //================德州市==================
        REGION_CODE_MAP.put("371421", "371403");//陵城区,国函〔2014〕139 号，2014-10-20 批复撤销陵县，设立陵城区
        REGION_CODE_MAP.put("371451", "371471");//开发区,德州经开区已改为德州天衢新区,编码为371471
        REGION_CODE_MAP.put("371483", "371401");//其他统一化为市辖区
        //================聊城市==================
        REGION_CODE_MAP.put("371523", "371503");//茌平区,2019 年 6 月国函〔2019〕60 号批复撤销茌平县设立茌平区
        REGION_CODE_MAP.put("371582", "371501");//其他统一化为市辖区
        //================滨州市==================
        REGION_CODE_MAP.put("371624", "371603");//沾化区,2014 年 9 月国函〔2014〕119 号批复撤销沾化县，设立沾化区
        REGION_CODE_MAP.put("371626", "371681");//邹平市,2018 年 7 月民函〔2018〕105 号批复撤邹平县设邹平市
        REGION_CODE_MAP.put("371627", "371601");//其他统一化为市辖区
        //================菏泽市==================
        REGION_CODE_MAP.put("371727", "371703");//定陶区,2016 年 1 月国函〔2016〕7 号批复撤销定陶县，设立定陶区
        REGION_CODE_MAP.put("371729", "371701");//其他统一化为市辖区

        //================河南省==================
        //================郑州市==================
        REGION_CODE_MAP.put("410186", "410101");//郑东新区,编码不存在,统一化为市辖区
        REGION_CODE_MAP.put("410187", "410172");//高新区,郑州高新区为独立统计用区划单位,编码为410172
        REGION_CODE_MAP.put("410188", "410101");//其他统一化为市辖区
        //================开封市==================
        REGION_CODE_MAP.put("410211", "410202");//金明区,2014 年国函〔2014〕121 号批复，撤销原龙亭区、金明区，合并设立新龙亭区
        REGION_CODE_MAP.put("410224", "410212");//祥符区,2014 年国函〔2014〕121 号批复撤销开封县，设立祥符区，
        REGION_CODE_MAP.put("410226", "410201");//其他统一化为市辖区
        //================洛阳市==================
        REGION_CODE_MAP.put("410306", "410308");//吉利区,2021年撤销与孟津县合并设孟津区
        REGION_CODE_MAP.put("410307", "410311");//洛龙区,2021年洛阳区划调整后410307为偃师区,洛龙区为410311,
        REGION_CODE_MAP.put("410322", "410308");//孟津区,2021 年 3 月国函批复，撤销孟津县、吉利区合并设立孟津区
        REGION_CODE_MAP.put("410381", "410307");//偃师区,2021 年 1 月国函〔2021〕10 号批复撤销县级偃师市，设立偃师区
        //================平顶山市==================
        REGION_CODE_MAP.put("410483", "410401");//其他统一化为市辖区
        //================安阳市==================
        REGION_CODE_MAP.put("410582", "410501");//其他统一化为市辖区
        //================鹤壁市==================
        REGION_CODE_MAP.put("410623", "410601");//其他统一化为市辖区
        //================新乡市==================
        REGION_CODE_MAP.put("410728", "410783");//长垣县,2019 年 8 月国务院批复撤长垣县设长垣市
        REGION_CODE_MAP.put("410784", "410783");//长垣市,
        REGION_CODE_MAP.put("410783", "410701");//其他统一化为市辖区
        //================焦作市==================
        REGION_CODE_MAP.put("410884", "410801");//其他统一化为市辖区
        //================濮阳市==================
        REGION_CODE_MAP.put("410929", "410901");//其他统一化为市辖区
        //================许昌市==================
        REGION_CODE_MAP.put("411023", "411003");//建安区,原**许昌县（411023）**，2016 年国务院批复撤县设区
        REGION_CODE_MAP.put("411083", "411001");//其他统一化为市辖区
        //================漯河市==================
        REGION_CODE_MAP.put("411123", "411101");//其他统一化为市辖区
        //================三门峡市==================
        REGION_CODE_MAP.put("411222", "411203");//陕州区,原**陕县（411222）**，2015 年国务院批复撤县设区
        REGION_CODE_MAP.put("411283", "411201");//其他统一化为市辖区
        //================南阳市==================
        REGION_CODE_MAP.put("411382", "411301");//其他统一化为市辖区
        //================商丘市==================
        REGION_CODE_MAP.put("411482", "411401");//其他统一化为市辖区
        //================信阳市==================
        REGION_CODE_MAP.put("411529", "411501");//其他统一化为市辖区
        //================周口市==================
        REGION_CODE_MAP.put("411626", "411603");//淮阳区,原**淮阳县（411626）**，2019 年国务院批复撤县设区
        REGION_CODE_MAP.put("411682", "411601");//其他统一化为市辖区
        //================驻马店市==================
        REGION_CODE_MAP.put("411730", "411701");//其他统一化为市辖区

        //================湖北省==================
        //================武汉市==================
        REGION_CODE_MAP.put("420118", "420101");//其他统一化为市辖区
        //================黄石市==================
        REGION_CODE_MAP.put("420282", "420201");//其他统一化为市辖区
        //================十堰市==================
        REGION_CODE_MAP.put("420321", "420304");//郧阳区,十堰城区**不是独立法定行政区**，是口语统称，狭义主城区指**茅箭区、张湾区**；广义市辖区再加郧阳区
        REGION_CODE_MAP.put("420382", "420301");//城区,十堰城区**不是独立法定行政区**，是口语统称，狭义主城区指**茅箭区、张湾区**；广义市辖区再加郧阳区
        REGION_CODE_MAP.put("420383", "420301");//其他统一化为市辖区
        //================宜昌市==================
        REGION_CODE_MAP.put("420551", "420502");//葛洲坝区,原葛洲坝区域现属西陵区
        REGION_CODE_MAP.put("420552", "420502");//开发区,宜昌高新区东山园区属西陵区
        REGION_CODE_MAP.put("420584", "420501");//其他统一化为市辖区
        //================襄阳市==================
        REGION_CODE_MAP.put("420685", "420601");//其他统一化为市辖区
        //================鄂州市==================
        REGION_CODE_MAP.put("420705", "420701");//其他统一化为市辖区
        //================荆门市==================
        REGION_CODE_MAP.put("420821", "420882");//京山市,原**京山县**，2018 年经国务院批复撤县设县级京山市
        REGION_CODE_MAP.put("420882", "420801");//其他统一化为市辖区
        //================孝感市==================
        REGION_CODE_MAP.put("420985", "420901");//其他统一化为市辖区
        //================荆州市==================
        REGION_CODE_MAP.put("421023", "421088");//监利县,2020 年 6 月批复撤销监利县，设立县级监利市
        REGION_CODE_MAP.put("421088", "421001");//其他统一化为市辖区
        //================黄冈市==================
        REGION_CODE_MAP.put("421183", "421101");//其他统一化为市辖区
        //================咸宁市==================
        REGION_CODE_MAP.put("421282", "421202");//温泉城区,原温泉区域现属咸安区
        REGION_CODE_MAP.put("421283", "421201");//其他统一化为市辖区
        //================随州市==================
        REGION_CODE_MAP.put("421302", "421303");//曾都区,- 2000 年设立地级随州市，设置曾都区；2009 年从原曾都区划出部分乡镇新设**随县（421321）**，曾都区建制保留，**代码不变，仍为 421303**
        REGION_CODE_MAP.put("421382", "421301");//其他统一化为市辖区
        //================恩施土家族苗族自治州==================
        REGION_CODE_MAP.put("422829", "422801");//其他统一化为恩施市

        //================湖南省==================
        //================长沙市==================
        REGION_CODE_MAP.put("430122", "430112");//望城区,原**望城县（430122）**，2011 年国务院批复撤销望城县，设立长沙市望城区
        REGION_CODE_MAP.put("430124", "430182");//宁乡市,原**宁乡县（430124）**，2017 年批复撤县设县级宁乡市
        REGION_CODE_MAP.put("430182", "430101");//其他统一化为市辖区
        //================株洲市==================
        REGION_CODE_MAP.put("430221", "430212");//株洲县,2018 年 6 月国务院批复撤销株洲县，设立株洲市渌口区
        REGION_CODE_MAP.put("430282", "430201");//其他统一化为市辖区
        //================湘潭市==================
        REGION_CODE_MAP.put("430383", "430301");//其他统一化为市辖区
        //================衡阳市==================
        REGION_CODE_MAP.put("430483", "430401");//其他统一化为市辖区
        //================邵阳市==================
        REGION_CODE_MAP.put("430521", "430582");//邵东市,原**邵东县（430521）**，2019 年 7 月批复撤县设县级邵东市
        REGION_CODE_MAP.put("430582", "430501");//其他统一化为市辖区
        //================岳阳市==================
        REGION_CODE_MAP.put("430683", "430601");//其他统一化为市辖区
        //================常德市==================
        REGION_CODE_MAP.put("430782", "430701");//其他统一化为市辖区
        //================张家界市==================
        REGION_CODE_MAP.put("430823", "430801");//其他统一化为市辖区
        //================益阳市==================
        REGION_CODE_MAP.put("430982", "430901");//其他统一化为市辖区
        //================郴州市==================
        REGION_CODE_MAP.put("431082", "431001");//其他统一化为市辖区
        //================永州市==================
        REGION_CODE_MAP.put("431121", "431181");//祁阳市,2021 年 1 月批复撤销祁阳县，设立县级祁阳市
        REGION_CODE_MAP.put("431130", "431101");//其他统一化为市辖区
        //================怀化市==================
        REGION_CODE_MAP.put("431282", "431201");//其他统一化为市辖区
        //================娄底市==================
        REGION_CODE_MAP.put("431383", "431301");//其他统一化为市辖区
        //================湘西土家族苗族自治州==================
        REGION_CODE_MAP.put("433131", "433101");//其他统一化为吉首市

        //================广东省==================
        //================广州市==================
        REGION_CODE_MAP.put("440116", "440112");//萝岗区,22005 年设立广州市萝岗区；**2014 年撤销萝岗区，与黄埔区合并为新黄埔区**
        REGION_CODE_MAP.put("440183", "440118");//增城区,原**增城市（县级市）**，2014 年批复撤市设区，划归广州市
        REGION_CODE_MAP.put("440184", "440117");//从化区,原**从化市（县级市）**，2014 年批复撤市设区，划入广州市
        REGION_CODE_MAP.put("440188", "440104");//东山区,2005年4月国务院批复撤销,并入越秀区
        REGION_CODE_MAP.put("440189", "440101");//其他统一化为市辖区
        //================韶关市==================
        REGION_CODE_MAP.put("440283", "440201");//其他统一化为市辖区
        //================深圳市==================
        REGION_CODE_MAP.put("440311", "440309");//龙华区,2011 年设立**龙华新区（功能区）**，属地属于宝安区；2016 年国务院批复设龙华区，**2017 年 1 月正式挂牌成为法定市辖区**
        REGION_CODE_MAP.put("440320", "440311");//光明区,
        REGION_CODE_MAP.put("440321", "440310");//坪山新区,2009 年设立**坪山新区（功能区）**，法定隶属于**龙岗区**；2016 年国务院批复设立坪山区
        REGION_CODE_MAP.put("440322", "440301");//大鹏新区,编码不存在,统一化为市辖区
        REGION_CODE_MAP.put("440323", "440309");//龙华新区,现为龙华区(440309)
        //================珠海市==================
        REGION_CODE_MAP.put("440486", "440402");//金唐区,日常说的金唐 = 珠海高新区（唐家湾片区），属于**功能管理区，不是民政行政区**
        REGION_CODE_MAP.put("440487", "440402");//南湾区,**没有法定县级行政区叫 “南湾区”，属于片区俗称，一般叫南湾城区**，包含南屏镇、湾仔街道，法定隶属于**香洲区**
        REGION_CODE_MAP.put("440488", "440401");//其他统一化为市辖区
        //================汕头市==================
        REGION_CODE_MAP.put("440524", "440501");//其他统一化为市辖区
        //================佛山市==================
        REGION_CODE_MAP.put("440609", "440601");//其他统一化为市辖区
        //================江门市==================
        REGION_CODE_MAP.put("440786", "440701");//其他统一化为市辖区
        //================湛江市==================
        REGION_CODE_MAP.put("440884", "440801");//其他统一化为市辖区
        //================茂名市==================
        REGION_CODE_MAP.put("440903", "440904");//电白区,：2014 年国务院批复**撤销电白县、茂港区，二者合并设立电白区**
        REGION_CODE_MAP.put("440923", "440904");//电白县,：2014 年国务院批复**撤销电白县、茂港区，二者合并设立电白区**
        REGION_CODE_MAP.put("440984", "440901");//其他统一化为市辖区
        //================肇庆市==================
        REGION_CODE_MAP.put("441283", "441204");//高要区,原**高要市（县级）**，2015 年 4 月批复撤市设区
        REGION_CODE_MAP.put("441285", "441201");//其他统一化为市辖区
        //================惠州市==================
        REGION_CODE_MAP.put("441325", "441301");//其他统一化为市辖区
        //================梅州市==================
        REGION_CODE_MAP.put("441421", "441403");//梅县区,原**梅县**，2013 年批复撤县设梅县区
        REGION_CODE_MAP.put("441482", "441401");//其他统一化为市辖区
        //================汕尾市==================
        REGION_CODE_MAP.put("441582", "441501");//其他统一化为市辖区
        //================河源市==================
        REGION_CODE_MAP.put("441626", "441601");//其他统一化为市辖区
        //================阳江市==================
        REGION_CODE_MAP.put("441723", "441704");//阳东区,原**阳东县**，2014 年国务院批复撤销阳东县，设立阳江市阳东区
        REGION_CODE_MAP.put("441782", "441701");//其他统一化为市辖区
        //================清远市==================
        REGION_CODE_MAP.put("441827", "441803");//清新区,原**清新县**，2012 年 11 月批复撤县设清新区
        REGION_CODE_MAP.put("441883", "441801");//其他统一化为市辖区
        //================潮州市==================
        REGION_CODE_MAP.put("445121", "445103");//潮安区,原**潮安县**，2013 年 6 月批复撤县设潮安区
        REGION_CODE_MAP.put("445185", "445103");//枫溪区,原枫溪区域回归潮安区
        REGION_CODE_MAP.put("445186", "445101");//其他统一化为市辖区
        //================揭阳市==================
        REGION_CODE_MAP.put("445221", "445203");//揭东区,原揭东县，2012 年 12 月批复撤县设揭东区，
        REGION_CODE_MAP.put("445284", "445202");//东山区,非建制区(东山行政管理区);2013年撤销,辖区划归榕城区
        REGION_CODE_MAP.put("445285", "445201");//其他统一化为市辖区
        //================云浮市==================
        REGION_CODE_MAP.put("445323", "445303");//云安区,原**云安县**，2014 年 9 月国务院批复撤销云安县，设立云浮市云安区
        REGION_CODE_MAP.put("445382", "445301");//其他统一化为市辖区

        //区县变乡镇
        REGION_CODE_MAP.put("441901", "441900103");
        REGION_CODE_MAP.put("441902", "441900119");
        REGION_CODE_MAP.put("441903", "441900110");
        REGION_CODE_MAP.put("441904", "441900113");
        REGION_CODE_MAP.put("441905", "441900118");
        REGION_CODE_MAP.put("441906", "441900124");
        REGION_CODE_MAP.put("441907", "441900003");
        REGION_CODE_MAP.put("441908", "441900403");
        REGION_CODE_MAP.put("441909", "441900109");
        REGION_CODE_MAP.put("441910", "441900117");
        REGION_CODE_MAP.put("441911", "441900129");
        REGION_CODE_MAP.put("441912", "441900006");
        REGION_CODE_MAP.put("441913", "441900106");
        REGION_CODE_MAP.put("441914", "441900125");
        REGION_CODE_MAP.put("441915", "441900122");
        REGION_CODE_MAP.put("441917", "441900121");
        REGION_CODE_MAP.put("441918", "441900114");
        REGION_CODE_MAP.put("441919", "441900111");
        REGION_CODE_MAP.put("441920", "441900126");
        REGION_CODE_MAP.put("441921", "441900004");
        REGION_CODE_MAP.put("441922", "441900105");
        REGION_CODE_MAP.put("441923", "441900107");
        REGION_CODE_MAP.put("441924", "441900115");
        REGION_CODE_MAP.put("441925", "441900123");
        REGION_CODE_MAP.put("441926", "441900101");
        REGION_CODE_MAP.put("441927", "441900102");
        REGION_CODE_MAP.put("441928", "441900104");
        REGION_CODE_MAP.put("441930", "441900005");
        REGION_CODE_MAP.put("441931", "441900127");
        REGION_CODE_MAP.put("441932", "441900108");
        REGION_CODE_MAP.put("441933", "441900112");
        REGION_CODE_MAP.put("441934", "441900128");
        REGION_CODE_MAP.put("442001", "442000115");
        REGION_CODE_MAP.put("442003", "442000116");
        REGION_CODE_MAP.put("442004", "442000103");
        REGION_CODE_MAP.put("442006", "442000002");
        REGION_CODE_MAP.put("442007", "442000112");
        REGION_CODE_MAP.put("442008", "442000108");
        REGION_CODE_MAP.put("442009", "442000105");
        REGION_CODE_MAP.put("442010", "442000101");
        REGION_CODE_MAP.put("442012", "442000110");
        REGION_CODE_MAP.put("442014", "442000005");
        REGION_CODE_MAP.put("442016", "442000111");
        REGION_CODE_MAP.put("442018", "442000117");
        REGION_CODE_MAP.put("442020", "442000106");
        REGION_CODE_MAP.put("442021", "442000109");
        REGION_CODE_MAP.put("442022", "442000114");
        REGION_CODE_MAP.put("442023", "442000107");
        REGION_CODE_MAP.put("442024", "442000006");
        REGION_CODE_MAP.put("442025", "442000004");
        REGION_CODE_MAP.put("442026", "442000118");
        //=====================================

        //================广西壮族自治区==================
        //================南宁市==================
        REGION_CODE_MAP.put("450122", "450110");//武鸣区,原**武鸣县**，2015 年 3 月批复撤县设武鸣区
        REGION_CODE_MAP.put("450127", "450181");//横州市,2021年撤横县设横州市
        REGION_CODE_MAP.put("450128", "450101");//其他统一化为市辖区
        //================柳州市==================
        REGION_CODE_MAP.put("450221", "450206");//柳江区,原**柳江县**，2016 年 3 月国务院批复撤县设柳江区
        REGION_CODE_MAP.put("450227", "450201");//其他统一化为市辖区
        //================桂林市==================
        REGION_CODE_MAP.put("450322", "450312");//临桂区,原**临桂县**，2013 年 1 月国务院批复撤县设临桂区
        REGION_CODE_MAP.put("450331", "450381");//荔浦市,2018 年 7 月国务院批复撤销荔浦县，设立县级荔浦市
        REGION_CODE_MAP.put("450333", "450301");//其他统一化为市辖区
        //================梧州市==================
        REGION_CODE_MAP.put("450404", "450403");//蝶山区,2013 年国务院批复**撤销蝶山区、原万秀区，合并设立新的万秀区**
        REGION_CODE_MAP.put("450482", "450401");//其他统一化为市辖区
        //================北海市==================
        REGION_CODE_MAP.put("450522", "450501");//其他统一化为市辖区
        //================防城港市==================
        REGION_CODE_MAP.put("450682", "450601");//其他统一化为市辖区
        //================钦州市==================
        REGION_CODE_MAP.put("450723", "450701");//其他统一化为市辖区
        //================贵港市==================
        REGION_CODE_MAP.put("450882", "450801");//其他统一化为市辖区
        //================玉林市==================
        REGION_CODE_MAP.put("450982", "450901");//其他统一化为市辖区
        //================百色市==================
        REGION_CODE_MAP.put("451021", "451003");//田阳县,2019 年 6 月国务院批复撤销田阳县，设立百色市田阳区
        REGION_CODE_MAP.put("451023", "451082");//平果市,2019 年 12 月批复撤销平果县，设立县级平果市
        REGION_CODE_MAP.put("451025", "451081");//靖西市,2015 年 8 月批复撤销靖西县，设立县级靖西市
        REGION_CODE_MAP.put("451032", "451001");//其他统一化为市辖区
        //================贺州市==================
        REGION_CODE_MAP.put("451119", "451103");//平桂管理区,**2007 年设立平桂管理区**，属于贺州市政府派出的功能管理区，**不是国务院批准的法定县级行政区**，当时户籍身份证底层使用**八步区 451102**；**2016 年 7 月国务院批复设立正式的平桂区**
        REGION_CODE_MAP.put("451124", "451101");//其他统一化为市辖区
        //================河池市==================
        REGION_CODE_MAP.put("451281", "451203");//宜州区,前身是**宜州市（县级市）**，更早为宜山县；2016 年 12 月国务院批复撤销县级宜州市，设立河池市宜州区
        REGION_CODE_MAP.put("451282", "451201");//其他统一化为市辖区
        //================来宾市==================
        REGION_CODE_MAP.put("451382", "451301");//其他统一化为市辖区
        //================崇左市==================
        REGION_CODE_MAP.put("451482", "451401");//其他统一化为市辖区

        //================海南省==================
        //================海口市==================
        REGION_CODE_MAP.put("460109", "460101");//其他统一化为市辖区
        //================三沙市==================
        REGION_CODE_MAP.put("460324", "460400499");//洋浦经济开发区

        //================重庆市==================
        //================市辖区==================
        REGION_CODE_MAP.put("500222", "500110");//綦江区,2011年10月与万盛区合并设綦江区(国函〔2011〕129号)
        REGION_CODE_MAP.put("500223", "500152");//潼南区,2015年撤潼南县设潼南区,
        REGION_CODE_MAP.put("500224", "500151");//铜梁区,2014年撤铜梁县设铜梁区,
        REGION_CODE_MAP.put("500225", "500111");//大足区,2011年10月与双桥区合并设大足区(国函〔2011〕129号)
        REGION_CODE_MAP.put("500226", "500153");//荣昌区,2015年撤荣昌县设荣昌区
        REGION_CODE_MAP.put("500227", "500120");//璧山区,2014年撤璧山县设璧山区
        REGION_CODE_MAP.put("500228", "500155");//梁平区,2016年撤梁平县设梁平区
        REGION_CODE_MAP.put("500232", "500156");//武隆区,2016年撤武隆县设武隆区
        REGION_CODE_MAP.put("500234", "500154");//开州区,2016年撤开县设开州区
        REGION_CODE_MAP.put("500381", "500116");//江津区,2006年撤江津市设江津区
        REGION_CODE_MAP.put("500382", "500117");//合川区,2006年撤合川市设合川区
        REGION_CODE_MAP.put("500383", "500118");//永川区,2006年撤永川市设永川区
        REGION_CODE_MAP.put("500384", "500119");//南川区,2006年撤南川市设南川区
        REGION_CODE_MAP.put("500385", "5001");//其他统一化为市辖区

        //================四川省==================
        //================成都市==================
        REGION_CODE_MAP.put("510122", "510116");//2015 年 12 月批复撤销**双流县**，设立成都市双流区
        REGION_CODE_MAP.put("510124", "510117");//郫都区,2016 年 12 月批复撤销**郫县**，设立成都市郫都区
        REGION_CODE_MAP.put("510132", "510118");//新津区,
        REGION_CODE_MAP.put("510185", "510101");//其他统一化为市辖区
        //================自贡市==================
        REGION_CODE_MAP.put("510323", "510301");//其他统一化为市辖区
        //================攀枝花市==================
        REGION_CODE_MAP.put("510423", "510401");//其他统一化为市辖区
        //================泸州市==================
        REGION_CODE_MAP.put("510526", "510501");//其他统一化为市辖区
        //================德阳市==================
        REGION_CODE_MAP.put("510626", "510604");//罗江区,2017 年 7 月批复撤销**罗江县**，设立德阳市罗江区
        REGION_CODE_MAP.put("510684", "510601");//其他统一化为市辖区
        //================绵阳市==================
        REGION_CODE_MAP.put("510724", "510705");//安州区,2016 年 3 月批复撤销**安县**，设立绵阳市安州区
        REGION_CODE_MAP.put("510751", "510703");//高新区,绵阳高新区位于涪城区
        REGION_CODE_MAP.put("510782", "510701");//其他统一化为市辖区
        //================广元市==================
        REGION_CODE_MAP.put("510825", "510801");//其他统一化为市辖区
        //================遂宁市==================
        REGION_CODE_MAP.put("510922", "510981");//射洪市
        REGION_CODE_MAP.put("510924", "510901");//其他统一化为市辖区
        //================内江市==================
        REGION_CODE_MAP.put("511028", "511083");//隆昌市,2017 年 4 月批复撤销**隆昌县**，设立县级隆昌市
        REGION_CODE_MAP.put("511029", "511001");//其他统一化为市辖区
        //================乐山市==================
        REGION_CODE_MAP.put("511182", "511101");//其他统一化为市辖区
        //================南充市==================
        REGION_CODE_MAP.put("511382", "511301");//其他统一化为市辖区
        //================眉山市==================
        REGION_CODE_MAP.put("511422", "511403");//彭山区,：2014 年 10 月批复撤销**彭山县**，设立眉山市彭山区
        REGION_CODE_MAP.put("511426", "511401");//其他统一化为市辖区
        //================宜宾市==================
        REGION_CODE_MAP.put("511521", "511504");//叙州区,2018 年 7 月批复撤销**宜宾县**，设立宜宾市叙州区
        REGION_CODE_MAP.put("511522", "511503");//南溪区,2011 年批复撤销**南溪县**，设立宜宾市南溪区
        REGION_CODE_MAP.put("511530", "511501");//其他统一化为市辖区
        //================广安市==================
        REGION_CODE_MAP.put("511682", "511601");//市辖区,
        REGION_CODE_MAP.put("511683", "511601");//其他统一化为市辖区
        //================达州市==================
        REGION_CODE_MAP.put("511721", "511703");//达川区,2013 年批复撤销**达县**，设立达州市达川区；原达县 9 个乡镇划归通川区
        REGION_CODE_MAP.put("511782", "511701");//其他统一化为市辖区
        //================雅安市==================
        REGION_CODE_MAP.put("511821", "511803");//名山区,2012 年 11 月批复撤销**名山县**，设立雅安市名山区
        REGION_CODE_MAP.put("511828", "511801");//其他统一化为市辖区
        //================巴中市==================
        REGION_CODE_MAP.put("511924", "511901");//其他统一化为市辖区
        //================资阳市==================
        REGION_CODE_MAP.put("512081", "510185");//简阳市,2016 年 5 月划归成都代管
        REGION_CODE_MAP.put("512082", "512001");//其他统一化为市辖区
        //================阿坝藏族羌族自治州==================
        REGION_CODE_MAP.put("513229", "513201");//马尔康市,2015 年 11 月国务院批复撤马尔康县设马尔康市
        REGION_CODE_MAP.put("513234", "513201");//其他统一化为马尔康市
        //================甘孜藏族自治州==================
        REGION_CODE_MAP.put("513321", "513301");//康定市,2015 年 2 月国务院批复撤康定县设康定市，
        REGION_CODE_MAP.put("513339", "513301");//其他统一化为康定市
        //================凉山彝族自治州==================
        REGION_CODE_MAP.put("513425", "513402");//会理市,2021年撤会理县设会理市,
        REGION_CODE_MAP.put("513438", "513401");//其他统一化为西昌市

        //================贵州省==================
        //================贵阳市==================
        REGION_CODE_MAP.put("520114", "520111");//小河区,2012-11-15 国函〔2012〕190 号批复撤销小河区、老花溪区，合并设立新花溪区
        REGION_CODE_MAP.put("520151", "520115");//观山湖区,2012 年 11 月国务院批复设立观山湖区
        REGION_CODE_MAP.put("520182", "520101");//其他统一化为市辖区
        //================六盘水市==================
        REGION_CODE_MAP.put("520221", "520204");//水城县,现为水城区(520204)
        REGION_CODE_MAP.put("520222", "520281");//盘州市,2017 年 4 月民政部批复撤销盘县设立盘州市
        REGION_CODE_MAP.put("520223", "520201");//其他统一化为钟山区
        //================遵义市==================
        REGION_CODE_MAP.put("520321", "520304");//播州区,2016-03-20 国务院批复撤销遵义县，设立播州区
        REGION_CODE_MAP.put("520383", "520301");//其他统一化为市辖区
        //================安顺市==================
        REGION_CODE_MAP.put("520421", "520403");//平坝区,2014 年 12 月国函〔2014〕160 号批复撤县设区
        REGION_CODE_MAP.put("520426", "520401");//其他统一化为市辖区
        //================铜仁市==================
        REGION_CODE_MAP.put("522201", "520602");//碧江区,2011年撤铜仁地区设地级铜仁市,代码发生变更
        REGION_CODE_MAP.put("522222", "520621");//江口县,2011年撤铜仁地区设地级铜仁市,代码发生变更
        REGION_CODE_MAP.put("522223", "520622");//玉屏侗族自治县,2011年撤铜仁地区设地级铜仁市,代码发生变更
        REGION_CODE_MAP.put("522224", "520623");//石阡县,2011年撤铜仁地区设地级铜仁市,代码发生变更
        REGION_CODE_MAP.put("522225", "520624");//思南县,2011年撤铜仁地区设地级铜仁市,代码发生变更
        REGION_CODE_MAP.put("522226", "520625");//印江土家族苗族自治县,2011年撤铜仁地区设地级铜仁市,代码发生变更
        REGION_CODE_MAP.put("522227", "520626");//德江县,2011年撤铜仁地区设地级铜仁市,代码发生变更
        REGION_CODE_MAP.put("522228", "520627");//沿河土家族自治县,2011年撤铜仁地区设地级铜仁市,代码发生变更
        REGION_CODE_MAP.put("522229", "520628");//松桃苗族自治县,2011年撤铜仁地区设地级铜仁市,代码发生变更
        REGION_CODE_MAP.put("522230", "520603");//万山区,2011年撤铜仁地区设地级铜仁市,代码发生变更
        REGION_CODE_MAP.put("522231", "520601");//其他统一化为市辖区
        //================黔西南布依族苗族自治州==================
        REGION_CODE_MAP.put("522322", "522302");//兴仁市,2018年8月批复撤销兴仁县，设立县级兴仁市
        REGION_CODE_MAP.put("522329", "522301");//其他统一化为兴义市
        //================毕节市==================
        REGION_CODE_MAP.put("522401", "520502");//七星关区,2011年撤毕节地区设地级毕节市,全区县改码
        REGION_CODE_MAP.put("522422", "520521");//大方县,2011年撤毕节地区设地级毕节市,全区县改码
        REGION_CODE_MAP.put("522423", "520581");//黔西市,2021 年批复撤销黔西县,设立县级黔西市
        REGION_CODE_MAP.put("522424", "520523");//金沙县,2011年撤毕节地区设地级毕节市,全区县改码
        REGION_CODE_MAP.put("522425", "520524");//织金县,2011年撤毕节地区设地级毕节市,全区县改码
        REGION_CODE_MAP.put("522426", "520525");//纳雍县,2011年撤毕节地区设地级毕节市,全区县改码
        REGION_CODE_MAP.put("522427", "520526");//威宁彝族回族苗族自治县,2011年撤毕节地区设地级毕节市,全区县改码
        REGION_CODE_MAP.put("522428", "520527");//赫章县,2011年撤毕节地区设地级毕节市,全区县改码
        REGION_CODE_MAP.put("522429", "520501");//其他统一化为市辖区
        //================黔东南苗族侗族自治州==================
        REGION_CODE_MAP.put("522637", "522601");//其他统一化为凯里市
        //================黔南布依族苗族自治州==================
        REGION_CODE_MAP.put("522733", "522701");//其他统一化为都匀市

        //================云南省==================
        //================昆明市==================
        REGION_CODE_MAP.put("530121", "530114");//呈贡区,2011年5月批复撤销呈贡县，设立昆明市呈贡区
        REGION_CODE_MAP.put("530122", "530115");//晋宁区,2016年11月国务院批复撤销晋宁县，设立昆明市晋宁区
        REGION_CODE_MAP.put("530182", "530101");//其他统一化为市辖区
        //================曲靖市==================
        REGION_CODE_MAP.put("530321", "530304");//马龙区,2018年2月批复撤销马龙县，设立曲靖市马龙区
        REGION_CODE_MAP.put("530328", "530303");//沾益区,2016年3月国务院批复撤销沾益县，设立曲靖市沾益区
        REGION_CODE_MAP.put("530382", "530301");//其他统一化为市辖区
        //================玉溪市==================
        REGION_CODE_MAP.put("530421", "530403");//江川区,2015年12月国务院批复撤销江川县，设立玉溪市江川区
        REGION_CODE_MAP.put("530422", "530481");//澄江市,2019年12月批复撤销澄江县，设立县级澄江市
        REGION_CODE_MAP.put("530429", "530401");//其他统一化为市辖区
        //================保山市==================
        REGION_CODE_MAP.put("530522", "530581");//腾冲市,2015 年批复撤销腾冲县,设立县级腾冲市
        REGION_CODE_MAP.put("530525", "530501");//其他统一化为市辖区
        //================昭通市==================
        REGION_CODE_MAP.put("530630", "530681");//水富市,2018年7月批复撤销水富县,设立县级水富市，以原水富县辖区为新辖区，云南省直辖、昭通市代管
        REGION_CODE_MAP.put("530631", "530601");//其他统一化为市辖区
        //================丽江市==================
        REGION_CODE_MAP.put("530725", "530701");//其他统一化为市辖区
        //================普洱市==================
        REGION_CODE_MAP.put("530830", "530801");//其他统一化为市辖区
        //================临沧市==================
        REGION_CODE_MAP.put("530928", "530901");//其他统一化为市辖区
        //================楚雄彝族自治州==================
        REGION_CODE_MAP.put("532331", "532302");//禄丰市,2021年1月国务院批复撤销禄丰县，设立县级禄丰市
        REGION_CODE_MAP.put("532332", "532301");//其他统一化为楚雄市
        //================红河哈尼族彝族自治州==================
        REGION_CODE_MAP.put("532522", "532503");//蒙自市,2010年9月批复撤销蒙自县，设立县级蒙自市
        REGION_CODE_MAP.put("532526", "532504");//弥勒市,2013年1月国务院批复撤销弥勒县，设立县级弥勒市
        REGION_CODE_MAP.put("532533", "532501");//其他统一化为个旧市
        //================文山壮族苗族自治州==================
        REGION_CODE_MAP.put("532621", "532601");//文山市,2010年12月批复撤销文山县，设立县级文山市
        REGION_CODE_MAP.put("532629", "532601");//其他统一化为文山市
        //================西双版纳傣族自治州==================
        REGION_CODE_MAP.put("532824", "532801");//其他统一化为景洪市
        //================大理白族自治州==================
        REGION_CODE_MAP.put("532933", "532901");//其他统一化为大理市
        //================德宏傣族景颇族自治州==================
        REGION_CODE_MAP.put("533125", "533103");//其他统一化为芒市(德宏州州府)
        //================怒江傈僳族自治州==================
        REGION_CODE_MAP.put("533321", "533301");//泸水市,2016年6月批复撤销泸水县,设立县级泸水市
        REGION_CODE_MAP.put("533326", "533301");//其他统一化为泸水市
        //================迪庆藏族自治州==================
        REGION_CODE_MAP.put("533421", "533401");//香格里拉市,2014年撤县设县级香格里拉市
        REGION_CODE_MAP.put("533424", "533401");//其他统一化为香格里拉市

        //================西藏自治区==================
        //================拉萨市==================
        REGION_CODE_MAP.put("540125", "540103");//堆龙德庆区,2015年10月批复撤销堆龙德庆县,设立拉萨市堆龙德庆区
        REGION_CODE_MAP.put("540126", "540104");//达孜区,2017年7月国务院批复撤销达孜县，设立拉萨市达孜区
        REGION_CODE_MAP.put("540128", "540101");//其他统一化为市辖区
        //================昌都市==================
        REGION_CODE_MAP.put("542121", "540302");//卡若区,2014年撤昌都地区设地级昌都市,全区县改码
        REGION_CODE_MAP.put("542122", "540321");//江达县,2014年撤昌都地区设地级昌都市,全区县改码
        REGION_CODE_MAP.put("542123", "540322");//贡觉县,2014年撤昌都地区设地级昌都市,全区县改码
        REGION_CODE_MAP.put("542124", "540323");//类乌齐县,2014年撤昌都地区设地级昌都市,全区县改码
        REGION_CODE_MAP.put("542125", "540324");//丁青县,2014年撤昌都地区设地级昌都市,全区县改码
        REGION_CODE_MAP.put("542126", "540325");//察雅县,2014年撤昌都地区设地级昌都市,全区县改码
        REGION_CODE_MAP.put("542127", "540326");//八宿县,2014年撤昌都地区设地级昌都市,全区县改码
        REGION_CODE_MAP.put("542128", "540327");//左贡县,2014年撤昌都地区设地级昌都市,全区县改码
        REGION_CODE_MAP.put("542129", "540328");//芒康县,2014年撤昌都地区设地级昌都市,全区县改码
        REGION_CODE_MAP.put("542132", "540329");//洛隆县,2014年撤昌都地区设地级昌都市,全区县改码
        REGION_CODE_MAP.put("542133", "540330");//边坝县,2014年撤昌都地区设地级昌都市,全区县改码
        REGION_CODE_MAP.put("542134", "540302");//其他统一化为卡若区(昌都市委市政府驻地)
        //================山南市==================
        REGION_CODE_MAP.put("542221", "540502");//乃东区,2016年撤山南地区设地级山南市,全区县改码
        REGION_CODE_MAP.put("542222", "540521");//扎囊县,2016年撤山南地区设地级山南市,全区县改码
        REGION_CODE_MAP.put("542223", "540522");//贡嘎县,2016年撤山南地区设地级山南市,全区县改码
        REGION_CODE_MAP.put("542224", "540523");//桑日县,2016年撤山南地区设地级山南市,全区县改码
        REGION_CODE_MAP.put("542225", "540524");//琼结县,2016年撤山南地区设地级山南市,全区县改码
        REGION_CODE_MAP.put("542226", "540525");//曲松县,2016年撤山南地区设地级山南市,全区县改码
        REGION_CODE_MAP.put("542227", "540526");//措美县,2016年撤山南地区设地级山南市,全区县改码
        REGION_CODE_MAP.put("542228", "540527");//洛扎县,2016年撤山南地区设地级山南市,全区县改码
        REGION_CODE_MAP.put("542229", "540528");//加查县,2016年撤山南地区设地级山南市,全区县改码
        REGION_CODE_MAP.put("542231", "540529");//隆子县,2016年撤山南地区设地级山南市,全区县改码
        REGION_CODE_MAP.put("542232", "540530");//错那市 2023 年 4 月，国务院批准撤销错那县，设立县级错那市，山南市代管
        REGION_CODE_MAP.put("542233", "540531");//浪卡子县,2016年撤山南地区设地级山南市,全区县改码
        REGION_CODE_MAP.put("542234", "540501");//其他统一化为市辖区
        //================日喀则市==================
        REGION_CODE_MAP.put("542301", "540202");//桑珠孜区,2014年撤日喀则地区设地级日喀则市,全区县改码
        REGION_CODE_MAP.put("542322", "540221");//南木林县,2014年撤日喀则地区设地级日喀则市,全区县改码
        REGION_CODE_MAP.put("542323", "540222");//江孜县,2014年撤日喀则地区设地级日喀则市,全区县改码
        REGION_CODE_MAP.put("542324", "540223");//定日县,2014年撤日喀则地区设地级日喀则市,全区县改码
        REGION_CODE_MAP.put("542325", "540224");//萨迦县,2014年撤日喀则地区设地级日喀则市,全区县改码
        REGION_CODE_MAP.put("542326", "540225");//拉孜县,2014年撤日喀则地区设地级日喀则市,全区县改码
        REGION_CODE_MAP.put("542327", "540226");//昂仁县,2014年撤日喀则地区设地级日喀则市,全区县改码
        REGION_CODE_MAP.put("542328", "540227");//谢通门县,2014年撤日喀则地区设地级日喀则市,全区县改码
        REGION_CODE_MAP.put("542329", "540228");//白朗县,2014年撤日喀则地区设地级日喀则市,全区县改码
        REGION_CODE_MAP.put("542330", "540229");//仁布县,2014年撤日喀则地区设地级日喀则市,全区县改码
        REGION_CODE_MAP.put("542331", "540230");//康马县,2014年撤日喀则地区设地级日喀则市,全区县改码
        REGION_CODE_MAP.put("542332", "540231");//定结县,2014年撤日喀则地区设地级日喀则市,全区县改码
        REGION_CODE_MAP.put("542333", "540232");//仲巴县,2014年撤日喀则地区设地级日喀则市,全区县改码
        REGION_CODE_MAP.put("542334", "540233");//亚东县,2014年撤日喀则地区设地级日喀则市,全区县改码
        REGION_CODE_MAP.put("542335", "540234");//吉隆县,2014年撤日喀则地区设地级日喀则市,全区县改码
        REGION_CODE_MAP.put("542336", "540235");//聂拉木县,2014年撤日喀则地区设地级日喀则市,全区县改码
        REGION_CODE_MAP.put("542337", "540236");//萨嘎县,2014年撤日喀则地区设地级日喀则市,全区县改码
        REGION_CODE_MAP.put("542338", "540237");//岗巴县,2014年撤日喀则地区设地级日喀则市,全区县改码
        REGION_CODE_MAP.put("542339", "540202");//其他统一化为桑珠孜区(日喀则市政府驻地)
        //================那曲市==================
        REGION_CODE_MAP.put("542421", "540602");//色尼区,2017年批复撤销那曲县,随那曲地区撤地设地级那曲市,设立色尼区.原那曲县辖区全部改为色尼区
        REGION_CODE_MAP.put("542422", "540621");//嘉黎县,2017年因那曲地区撤地设地级那曲市，代码发生变更
        REGION_CODE_MAP.put("542423", "540622");//比如县,2017年因那曲地区撤地设地级那曲市，代码发生变更
        REGION_CODE_MAP.put("542424", "540623");//聂荣县,2017年因那曲地区撤地设地级那曲市，代码发生变更
        REGION_CODE_MAP.put("542425", "540624");//安多县,2017年因那曲地区撤地设地级那曲市，代码发生变更
        REGION_CODE_MAP.put("542426", "540625");//申扎县,2017年因那曲地区撤地设地级那曲市，代码发生变更
        REGION_CODE_MAP.put("542427", "540626");//索县,2017年因那曲地区撤地设地级那曲市，代码发生变更
        REGION_CODE_MAP.put("542428", "540627");//班戈县,2017年因那曲地区撤地设地级那曲市，代码发生变更
        REGION_CODE_MAP.put("542429", "540628");//巴青县,2017年因那曲地区撤地设地级那曲市，代码发生变更
        REGION_CODE_MAP.put("542430", "540629");//尼玛县,2017年因那曲地区撤地设地级那曲市，代码发生变更
        REGION_CODE_MAP.put("542431", "540602");//其他统一化为色尼区(那曲市政府驻地)
        REGION_CODE_MAP.put("542432", "540630");//双湖县,2017年因那曲地区撤地设地级那曲市，代码发生变更
        //================阿里地区==================
        REGION_CODE_MAP.put("542528", "542523");//其他统一化为噶尔县(阿里地区行署驻狮泉河镇)
        //================林芝市==================
        REGION_CODE_MAP.put("542621", "540402");//巴宜区,原林芝县,2015年林芝地区撤地设地级林芝市,撤销林芝县设立巴宜区
        REGION_CODE_MAP.put("542622", "540421");//工布江达县,2015年林芝地区撤地设地级林芝市,地级段编码变更
        REGION_CODE_MAP.put("542623", "540422");//米林县,原米林县,林芝撤地设市后、撤县设市
        REGION_CODE_MAP.put("542624", "540423");//墨脱县,原林芝地区墨脱县，林芝地区撤地设地级林芝市,地级段编码变更
        REGION_CODE_MAP.put("542625", "540424");//波密县,2015年林芝地区撤地设地级林芝市,地级段编码变更
        REGION_CODE_MAP.put("542626", "540425");//察隅县,2015年林芝地区撤地设地级林芝市,地级段编码变更
        REGION_CODE_MAP.put("542627", "540426");//朗县,2015年林芝地区撤地设地级林芝市,地级段编码变更
        REGION_CODE_MAP.put("542628", "540402");//其他统一化为巴宜区(林芝市政府驻地)

        //================陕西省==================
        //================西安市==================
        REGION_CODE_MAP.put("610125", "610118");//鄠邑区,原名户县，2016 年批复撤县设区
        REGION_CODE_MAP.put("610126", "610117");//高陵区,原名高陵县,2014年12月国务院批复撤县设区
        REGION_CODE_MAP.put("610127", "610101");//其他统一化为市辖区
        //================铜川市==================
        REGION_CODE_MAP.put("610223", "610201");//其他统一化为市辖区
        //================宝鸡市==================
        REGION_CODE_MAP.put("610322", "610305");//凤翔区,2021年1月国务院批复撤销凤翔县，设立宝鸡市凤翔区
        REGION_CODE_MAP.put("610332", "610301");//其他统一化为市辖区
        //================咸阳市==================
        REGION_CODE_MAP.put("610427", "610482");//彬州市,2018 年 5月批复撤销彬县，设立县级彬州市，原辖区不变
        REGION_CODE_MAP.put("610482", "610401");//其他统一化为市辖区
        //================渭南市==================
        REGION_CODE_MAP.put("610521", "610503");//华州区,原华县,2015 年 10 月国务院批复撤县设区
        REGION_CODE_MAP.put("610583", "610501");//其他统一化为市辖区
        //================延安市==================
        REGION_CODE_MAP.put("610623", "610681");//子长市,2019年7 月批复撤销子长县，设立县级子长市
        REGION_CODE_MAP.put("610624", "610603");//安塞区,原安塞县，2016 年 6 月国函〔2016〕104 号批复撤县设区
        REGION_CODE_MAP.put("610633", "610601");//其他统一化为市辖区
        //================汉中市==================
        REGION_CODE_MAP.put("610721", "610703");//南郑区,原南郑县，2017 年 8 月国函〔2017〕108 号批复撤县设区
        REGION_CODE_MAP.put("610731", "610701");//其他统一化为市辖区
        //================榆林市==================
        REGION_CODE_MAP.put("610821", "610881");//神木市,2017年4月批复撤销神木县
        REGION_CODE_MAP.put("610823", "610803");//横山区,原横山县，国函〔2015〕209 号批复撤县设区
        REGION_CODE_MAP.put("610832", "610801");//其他统一化为市辖区
        //================安康市==================
        REGION_CODE_MAP.put("610928", "610981");//旬阳市,2021年2月批复撤销旬阳县，设立县级旬阳市
        REGION_CODE_MAP.put("610930", "610901");//其他统一化为市辖区
        //================商洛市==================
        REGION_CODE_MAP.put("611027", "611001");//其他统一化为市辖区

        //================甘肃省==================
        //================兰州市==================
        REGION_CODE_MAP.put("620124", "620101");//其他统一化为市辖区
        //================金昌市==================
        REGION_CODE_MAP.put("620322", "620301");//其他统一化为市辖区
        //================白银市==================
        REGION_CODE_MAP.put("620424", "620401");//其他统一化为市辖区
        //================天水市==================
        REGION_CODE_MAP.put("620526", "620501");//其他统一化为市辖区
        //================武威市==================
        REGION_CODE_MAP.put("620624", "620601");//其他统一化为市辖区
        //================张掖市==================
        REGION_CODE_MAP.put("620726", "620701");//其他统一化为市辖区
        //================平凉市==================
        REGION_CODE_MAP.put("620824", "620881");//华亭市,2018年8月批复撤销华亭县，设立县级华亭市
        REGION_CODE_MAP.put("620827", "620801");//其他统一化为市辖区
        //================酒泉市==================
        REGION_CODE_MAP.put("620983", "620901");//其他统一化为市辖区
        //================庆阳市==================
        REGION_CODE_MAP.put("621028", "621001");//其他统一化为市辖区
        //================定西市==================
        REGION_CODE_MAP.put("621127", "621101");//其他统一化为市辖区
        //================陇南市==================
        REGION_CODE_MAP.put("621229", "621201");//其他统一化为市辖区
        //================临夏回族自治州==================
        REGION_CODE_MAP.put("622928", "622901");//其他统一化为临夏市
        //================甘南藏族自治州==================
        REGION_CODE_MAP.put("623028", "623001");//其他统一化为合作市

        //================青海省==================
        //================西宁市==================
        REGION_CODE_MAP.put("630122", "630106");//湟中区,原湟中县，国函〔2019〕106 号批复撤县设区
        REGION_CODE_MAP.put("630124", "630101");//其他统一化为市辖区
        //================海东市==================
        REGION_CODE_MAP.put("632121", "630203");//平安区,原平安县,国函(2015)38号2015年2月批复撤县设区
        REGION_CODE_MAP.put("632122", "630222");//民和回族土族自治县,2013年海东撤地设市，地级编码变更
        REGION_CODE_MAP.put("632123", "630202");//乐都区,原乐都县，2013撤地设市、同时乐都撤县设区
        REGION_CODE_MAP.put("632126", "630223");//互助土族自治县,2013年海东撤地设市，地级编码变更
        REGION_CODE_MAP.put("632127", "630224");//化隆回族自治县,2013年海东撤地设市，地级编码变更
        REGION_CODE_MAP.put("632128", "630225");//循化撒拉族自治县,2013年海东撤地设市，地级编码变更
        REGION_CODE_MAP.put("632129", "630202");//其他统一化为乐都区(海东市政府驻地)
        //================海北藏族自治州==================
        REGION_CODE_MAP.put("632225", "632223");//其他统一化为海晏县(海北州州府驻西海镇)
        //================黄南藏族自治州==================
        REGION_CODE_MAP.put("632321", "632301");//同仁市,2020年6月批复撤销同仁县,设立县级同仁市
        REGION_CODE_MAP.put("632325", "632301");//其他统一化为同仁市
        //================海南藏族自治州==================
        REGION_CODE_MAP.put("632526", "632521");//其他统一化为共和县(海南州州府)
        //================果洛藏族自治州==================
        REGION_CODE_MAP.put("632627", "632621");//其他统一化为玛沁县(果洛州州府)
        //================玉树藏族自治州==================
        REGION_CODE_MAP.put("632721", "632701");//玉树市,2013 年 10 月批复撤销玉树县,设立县级玉树市
        REGION_CODE_MAP.put("632727", "632701");//其他统一化为玉树市
        //================海西蒙古族藏族自治州==================
        REGION_CODE_MAP.put("632824", "632801");//其他统一化为格尔木市
        REGION_CODE_MAP.put("632825", "632801");//海西蒙古族藏族自治州直辖,编码不存在,统一化为格尔木市

        //================宁夏回族自治区==================
        //================银川市==================
        REGION_CODE_MAP.put("640182", "640101");//其他统一化为市辖区
        //================石嘴山市==================
        REGION_CODE_MAP.put("640222", "640201");//其他统一化为市辖区
        //================吴忠市==================
        REGION_CODE_MAP.put("640382", "640301");//其他统一化为市辖区
        //================固原市==================
        REGION_CODE_MAP.put("640426", "640401");//其他统一化为市辖区
        //================中卫市==================
        REGION_CODE_MAP.put("640523", "640501");//其他统一化为市辖区


        //================新疆维吾尔自治区==================
        //================乌鲁木齐市==================
        REGION_CODE_MAP.put("650108", "650109");//东山区,2007年6月,撤销乌鲁木齐市东山区(650108)、撤销昌吉州米泉市(652302)，二者合并新设乌鲁木齐市米东区(650109)
        REGION_CODE_MAP.put("650122", "650101");//其他统一化为市辖区
        //================克拉玛依市==================
        REGION_CODE_MAP.put("650206", "650201");//其他统一化为市辖区
        //================吐鲁番市==================
        REGION_CODE_MAP.put("652101", "650402");//高昌区,2015年吐鲁番地区撤地设地级吐鲁番市，地级编码变更
        REGION_CODE_MAP.put("652122", "650421");//鄯善县,2015年吐鲁番地区撤地设地级吐鲁番市，地级编码变更
        REGION_CODE_MAP.put("652123", "650422");//托克逊县,2015吐鲁番地区撤地设地级吐鲁番市，地级编码变更
        REGION_CODE_MAP.put("652124", "650402");//其他统一化为高昌区(吐鲁番市政府驻地)
        //================哈密市==================
        REGION_CODE_MAP.put("652201", "650502");//伊州区,2016 年哈密地区撤地设地级哈密市，县级哈密市(652201)撤销，设立伊州区
        REGION_CODE_MAP.put("652222", "650521");//巴里坤哈萨克自治县,2016年撤哈密地区设地级哈密市,全区县改码
        REGION_CODE_MAP.put("652223", "650522");//伊吾县,2016年哈密地区撤地设地级哈密市,地级编码变更
        REGION_CODE_MAP.put("652224", "650502");//其他统一化为伊州区(哈密市政府驻地)
        //================昌吉回族自治州==================
        REGION_CODE_MAP.put("652303", "650109");//米泉市,原属昌吉回族自治州,2007年和乌鲁木齐东山区合并,设立乌鲁木齐市米东区，米泉市建制撤销
        REGION_CODE_MAP.put("652329", "652301");//其他统一化为昌吉市
        //================博尔塔拉蒙古自治州==================
        REGION_CODE_MAP.put("652724", "652701");//其他统一化为博乐市
        //================巴音郭楞蒙古自治州==================
        REGION_CODE_MAP.put("652830", "652801");//其他统一化为库尔勒市
        //================阿克苏地区==================
        REGION_CODE_MAP.put("652923", "652902");//库车市,2019年12月批复撤销库车县,设立县级库车市
        REGION_CODE_MAP.put("652930", "652901");//其他统一化为阿克苏市
        //================克孜勒苏柯尔克孜自治州==================
        REGION_CODE_MAP.put("653025", "653001");//其他统一化为阿图什市
        //================喀什地区==================
        REGION_CODE_MAP.put("653132", "653101");//其他统一化为喀什市
        //================和田地区==================
        REGION_CODE_MAP.put("653228", "653201");//其他统一化为和田市
        //================伊犁哈萨克自治州==================
        REGION_CODE_MAP.put("654029", "654002");//其他统一化为伊宁市(伊犁州州府)
        //================塔城地区==================
        REGION_CODE_MAP.put("654223", "654203");//沙湾市,2021年1月批复撤销沙湾县，设立县级沙湾市
        REGION_CODE_MAP.put("654227", "654201");//其他统一化为塔城市
        //================阿勒泰地区==================
        REGION_CODE_MAP.put("654327", "654301");//其他统一化为阿勒泰市
        //================自治区直辖县级行政区划==================
        REGION_CODE_MAP.put("659075", "650203");//五五新镇街道,编码不存在,克拉玛依区
        REGION_CODE_MAP.put("659076", "659010");//兵团一二八团,团场属于乡级单位,归属自治区直辖县级市胡杨河市
        REGION_CODE_MAP.put("659077", "659010");//兵团一二九团,团场属于乡级单位,归属自治区直辖县级市胡杨河市
        REGION_CODE_MAP.put("659078", "659010");//兵团一三零团
    }

    public static String map(String regionCode){
        if(REGION_CODE_MAP.containsKey(regionCode)){
            return REGION_CODE_MAP.get(regionCode);
        }
        return regionCode;
    }
}
